{
"about_desc" : [
  {
    "href": "#one!",
    "image": "assets/images/about/intro.jpg",
    "desc": "Since its humble beginnings in the 1980s, Incident has grown to become the second largest cultural festival in India. Over the course of five spectacular days, Incident attracts over 40000 people across India. In recent years, Incident has seen some on India’s greatest talents grace its stage with their presence."
  },
  {
    "href": "#two!",
    "image": "assets/images/about/more-than-fest.jpg",
    "desc": "But Incident is more than a festival."
  },
  {
    "href": "#three!",
    "image": "assets/images/about/unseen-talents.jpg",
    "desc": "Incident is a launchpad; a platform for the unseen talents of the world."
  },
  {
    "href": "#four!",
    "image": "assets/images/about/compassion.jpg",
    "desc": "Incident is about compassion for our people and our environment."
  },
  {
    "href": "#five!",
    "image": "assets/images/about/friendships-memories.jpg",
    "desc": "It is about the people, where friendships are born and memories made."
  },
  {
    "href": "#six!",
    "image": "assets/images/about/connecting-people.jpg",
    "desc": "Incident lays the foundation for new bridges, connecting people thousands of miles apart."
  },
  {
    "href": "#seven!",
    "image": "assets/images/about/unknown-paths.jpg",
    "desc": "It is a spectacle, where every step taken is a new experience on an unknown path.<br/> Incident is a phenomenon."
  }
],

"history": [
 {
   "year": "2018 - A Global Odyssey",
   "image": "assets/images/about/inci-18.jpg",
   "desc": "The thousands of cultures, languages and cuisines give our planet its profound beauty and joy. To truly be citizens of the world, we must experience, understand, appreciate and enjoy other cultures and their traditions. Incident’18, ‘A Global Odyssey’, was about bridging the gap between our world’s different cultures and traditions. The hilarious Sahil Shah from EIC started off proceedings with an amazing set powered by his characterful jests and unique delivery. Folks from Sony set up a Sony Experience Zone, complete with PS4s, a VR Rig, foosball and more. NITK’s beach sky was adorned by hundreds of stunning Kites as part of the Incident’s Kite Festival. <br/> The second night kicked off with Chai Met Toast’s soulful performance with their characteristic happy-go-lucky music followed by an ecstatic show by the Catalonian band, Itaca Band. Itaca Band’s signature high energy style, combining elements of reggae, rock, latin and electronic music, was complemented by the band’s own enthusiasm. <br/> The festivities continued on the third day of incident with Holi and Haute Couture. The Itaca band members joined in on the holi celebrations on the streets. Haute couture was extravagant with universities across India participating in the prestigious fashion competition. The fourth night was the Odyssey’s mantlepiece. Benny dayal performed for Popular Night, blowing the audience away with his charisma and skill. Incident was far from over though, with Promenade, the Slam Dunk Finals, Informalz and the Cultural Experience Zone set up by the British Council, the last few days of incident were a blur. <br/> Incident wrapped up with Zaeden and Ritviz, they're masterful mixes closing off the Odyssey. Incident’18, A Global Odyssey was about the people and their experiences and it truly lived up to its promides."
 },
 {
   "year": "2017 - A Costal Carnival",
   "image": "assets/images/about/inci-17.jpg",
   "desc": "A metaphor for fun and limitless possibilities, our famous coastline seemed the perfect inspiration for our annual fete. And it was only apt that the 2017 edition was known as ‘A Coastal Carnival’.<br/> Karthick Iyer started off proceedings with IndoSoul, a perfect blend of classical and contemporary music, mesmerizing us with his beautiful compositions. Flagship event Slam Dunk got underway early next day, as was Pulse, Informalz and a vintage car expo, before a mind-numbing performance Baiju Dharmajan Syndicate, jam-packed with sublime original compositions and covers. And before anyone had any time to recover, Kerala based Eastern music band Masala Coffee put up an outstanding show. Covering popular songs in various languages and blending folk culture into their compositions, it was simply a night no one would ever forget. 2017 marked the beginning of Inci Talks, a gathering of renowned minds from across the country, with political leader Dr Jayaprakash Narayan, author and entrepreneur Mr Balaji Vishwanath and popular actor and former netball captain of the Indian national team, Prachi Tehlan addressing the audience. Business, literary, music and dance were all in full swing by March 3rd, as Angad Singh Ranyal tickled our funny bones with his impeccable timing and punchlines with Seedhi Baat, No Bakwaas. The Red Bull Tour Bus made its way into our college and in Lagori and Oceantied, it brought in one spectacular party. Haute Couture, with its signature exotic costumes and enchanting choreographies, wrapped up another amazing day, but Incident was far from over. With Promenade, Step Up, Bandish, Raagalaya, Spinshock and a Stunt Show from the Attitude Team, day 4 was a blur before The Local Train won us over with their “Hindie” rock music. A Kite Festival at the beach, Tandav, EDM artists Lost Stories and DJ AceAxe all helped us reluctantly bid adieu to another breathtaking edition of Incident, an edition that raised the bar and our expectations for the years to come."
 },
 {
   "year": "2016 - Legends Awaken",
   "image": "assets/images/about/inci-16.jpg",
   "desc": "Kick-starting with Sand Melody, a beautiful sand painting performance by Raghavendra Hegde,Incident 2016 truly awakened the legends across NITK's coast. Followed by the Comedy night, Kenny Sebastian's hilarious stand up comedy and his brilliant songs left us all laughing to our hearts content! Incident 2016 gave us a legendary lineup of bands and artists for Pronites events.<br/> Indie bands like Junkyard Groove and Parvaaz had us grooving to their incredible and original music. LoudStreet Girls and SilverString Band owned the night with their extraordinary energy and amazing girlpower! SilverString girls with their upbeat bollywood melodies had the students pronging the dance floor till three in the morning. <br/> For all the fashionistas of our college, Incident 2016 brought double the happiness with Haute Couture and Campus Princess Auditions held back to back! Campus Princess Audition in association with Miss India Organisation,Times Group provided a platform for the Karnataka girls to have a shot at Miss Diva 2016 and possibly represent India at the Miss Universe 2016.<br/> Along with the usual lineups of intriguing workshops,the immensely popular Shiamak Davar dance institute also held a Dance Workshop for all the amateur dance enthusiasts.A Fresh Face competition was also held among the 2016 freshers. Facebook was used as a platform to vote and support the confident, beautiful girls and boys of first year.<br/> Incident 2016 topped off with a melodious performance by the Rehman sisters as they performed numerous bollywood and south Indian songs!"
 },
 {
   "year": "2015 - High on Colors",
   "image": "assets/images/about/inci-16.jpg",
   "desc": "Incident 2015 was nothing short of spectacular, even by the standards set by the previous years. With Holi coinciding with Incident on the calendar, 'High on Colours’ encompassed the entire gamut of events that Incident had in store.<br/> Incident 2015 had a record-breaking online presence with the ‘Mauka Mauka’ video, which garnered over 140, 000 views. Also popular was the Inci Blog, featuring reviews of student eat-out hotspots in Mangalore, the inspiration behind the theme and as the fest progressed, the events covered by the Inci Press.<br/> The Slam Dunk inauguration and a side-splitting performance by the East India Comedy were the highlights of Day 0 with EIC and their ‘Ghanta Awards’ setting the tone for the rest of the festivities. From the Kalakriti inauguration, the Word Games organized by the Literary, Stage & Debating Society to the Kite Fest – there was something for everyone. Haute Couture saw a record number of registrations and even requests to shift dates. The competition was pleasantly interrupted by Ukrainian belly dancer Sonia Nakti’s captivating performance, one that was simply the epitome of fluidity and grace. And with Holi, the theme literally came to life and the euphoria induced by dousing each other in colour leaked into the day’s events, from the dance competitions that showcased a myriad of vibrant performances to the Beach Events, electrified by the DJs battling it out in the DJ Wars. Thermal and a Quarter enthralled the crowd under a star-studded night-sky at the SAC with a wide array of songs. Come the next evening, a couple of dazzling stars had descended upon us, and as Vishal-Shekhar gave us all a night to remember, as we threw our hands in the air and screamed ourselves hoarse, there was something surreal about that day. Over at the basketball court, Slam Dunk ended in a nail-biting finish, right before the DJ night with Mightyfools and DJ ASen commenced, a perfect culmination to the incredible experience Incident 2015 had been. Staying true to the theme, Incident 2015 remains a kaleidoscope of indelible memories and experiences."
 }
]

}
